hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_mcan_regs.h
/*
 * PED (RW)
 *
 * Protocol Error in Data Phase (Data Bit Time is used)
 * 0= No protocol error in data phase
 * 1= Protocol error in data phase detected (PSR.DLEC ≠ 0,7)
 */
#define MCAN_IR_PED_MASK (0x10000000UL)
#define MCAN_IR_PED_SHIFT (28U)
#define MCAN_IR_PED_SET(x) (((uint32_t)(x) << MCAN_IR_PED_SHIFT) & MCAN_IR_PED_MASK)
#define MCAN_IR_PED_GET(x) (((uint32_t)(x) & MCAN_IR_PED_MASK) >> MCAN_IR_PED_SHIFT)

/*
 * PEA (RW)
 *
 * Protocol Error in Arbitration Phase (Nominal Bit Time is used)
 * 0= No protocol error in arbitration phase
 * 1= Protocol error in arbitration phase detected (PSR.LEC ≠ 0,7)
 */
#define MCAN_IR_PEA_MASK (0x8000000UL)
#define MCAN_IR_PEA_SHIFT (27U)
#define MCAN_IR_PEA_SET(x) (((uint32_t)(x) << MCAN_IR_PEA_SHIFT) & MCAN_IR_PEA_MASK)
#define MCAN_IR_PEA_GET(x) (((uint32_t)(x) & MCAN_IR_PEA_MASK) >> MCAN_IR_PEA_SHIFT)

/*
 * WDI (RW)
 *
 * Watchdog Interrupt
 * 0= No Message RAM Watchdog event occurred
 * 1= Message RAM Watchdog event due to missing READY
 */
#define MCAN_IR_WDI_MASK (0x4000000UL)
#define MCAN_IR_WDI_SHIFT (26U)
#define MCAN_IR_WDI_SET(x) (((uint32_t)(x) << MCAN_IR_WDI_SHIFT) & MCAN_IR_WDI_MASK)
#define MCAN_IR_WDI_GET(x) (((uint32_t)(x) & MCAN_IR_WDI_MASK) >> MCAN_IR_WDI_SHIFT)

/*
 * BO (RW)
 *
 * Bus_Off Status
 * 0= Bus_Off status unchanged
 * 1= Bus_Off status changed
 */
#define MCAN_IR_BO_MASK (0x2000000UL)
#define MCAN_IR_BO_SHIFT (25U)
#define MCAN_IR_BO_SET(x) (((uint32_t)(x) << MCAN_IR_BO_SHIFT) & MCAN_IR_BO_MASK)
#define MCAN_IR_BO_GET(x) (((uint32_t)(x) & MCAN_IR_BO_MASK) >> MCAN_IR_BO_SHIFT)

/*
 * EW (RW)
 *
 * Warning Status
 * 0= Error_Warning status unchanged
 * 1= Error_Warning status changed
 */
#define MCAN_IR_EW_MASK (0x1000000UL)
#define MCAN_IR_EW_SHIFT (24U)
#define MCAN_IR_EW_SET(x) (((uint32_t)(x) << MCAN_IR_EW_SHIFT) & MCAN_IR_EW_MASK)
#define MCAN_IR_EW_GET(x) (((uint32_t)(x) & MCAN_IR_EW_MASK) >> MCAN_IR_EW_SHIFT)

/*
 * EP (RW)
 *
 * Error Passive
 * 0= Error_Passive status unchanged
 * 1= Error_Passive status changed
 */
#define MCAN_IR_EP_MASK (0x800000UL)
#define MCAN_IR_EP_SHIFT (23U)
#define MCAN_IR_EP_SET(x) (((uint32_t)(x) << MCAN_IR_EP_SHIFT) & MCAN_IR_EP_MASK)
#define MCAN_IR_EP_GET(x) (((uint32_t)(x) & MCAN_IR_EP_MASK) >> MCAN_IR_EP_SHIFT)

/*
 * ELO (RW)
 *
 * Error Logging Overflow
 * 0= CAN Error Logging Counter did not overflow
 * 1= Overflow of CAN Error Logging Counter occurred
 */
#define MCAN_IR_ELO_MASK (0x400000UL)
#define MCAN_IR_ELO_SHIFT (22U)
#define MCAN_IR_ELO_SET(x) (((uint32_t)(x) << MCAN_IR_ELO_SHIFT) & MCAN_IR_ELO_MASK)
#define MCAN_IR_ELO_GET(x) (((uint32_t)(x) & MCAN_IR_ELO_MASK) >> MCAN_IR_ELO_SHIFT)

/*
 * BEU (RW)
 *
 * Bit Error Uncorrected
 * Message RAM bit error detected, uncorrected. Controlled by input signal m_can_aeim_berr[1] generated by an optional external parity / ECC logic attached to the Message RAM.
 * An uncorrected Message RAM bit error sets CCCR.INIT to ‘1’. This is done to avoid transmission of corrupted data.
 * 0= No bit error detected when reading from Message RAM
 * 1= Bit error detected, uncorrected (e.g. parity logic)
 */
#define MCAN_IR_BEU_MASK (0x200000UL)
#define MCAN_IR_BEU_SHIFT (21U)
#define MCAN_IR_BEU_SET(x) (((uint32_t)(x) << MCAN_IR_BEU_SHIFT) & MCAN_IR_BEU_MASK)
#define MCAN_IR_BEU_GET(x) (((uint32_t)(x) & MCAN_IR_BEU_MASK) >> MCAN_IR_BEU_SHIFT)

/*
 * BEC (RW)
 *
 * Bit Error Corrected
 * Message RAM bit error detected and corrected. Controlled by input signal m_can_aeim_berr[0] generated by an optional external parity / ECC logic attached to the Message RAM.
 * 0= No bit error detected when reading from Message RAM
 * 1= Bit error detected and corrected (e.g. ECC)
 */
#define MCAN_IR_BEC_MASK (0x100000UL)
#define MCAN_IR_BEC_SHIFT (20U)
#define MCAN_IR_BEC_SET(x) (((uint32_t)(x) << MCAN_IR_BEC_SHIFT) & MCAN_IR_BEC_MASK)
#define MCAN_IR_BEC_GET(x) (((uint32_t)(x) & MCAN_IR_BEC_MASK) >> MCAN_IR_BEC_SHIFT)

/*
 * DRX (RW)
 *
 * Message stored to Dedicated Rx Buffer
 * The flag is set whenever a received message has been stored into a dedicated Rx Buffer.
 * 0= No Rx Buffer updated
 * 1= At least one received message stored into an Rx Buffer
 */
#define MCAN_IR_DRX_MASK (0x80000UL)
#define MCAN_IR_DRX_SHIFT (19U)
#define MCAN_IR_DRX_SET(x) (((uint32_t)(x) << MCAN_IR_DRX_SHIFT) & MCAN_IR_DRX_MASK)
#define MCAN_IR_DRX_GET(x) (((uint32_t)(x) & MCAN_IR_DRX_MASK) >> MCAN_IR_DRX_SHIFT)

/*
 * TOO (RW)
 *
 * Timeout Occurred
 * 0= No timeout
 * 1= Timeout reached
 */
#define MCAN_IR_TOO_MASK (0x40000UL)
#define MCAN_IR_TOO_SHIFT (18U)
#define MCAN_IR_TOO_SET(x) (((uint32_t)(x) << MCAN_IR_TOO_SHIFT) & MCAN_IR_TOO_MASK)
#define MCAN_IR_TOO_GET(x) (((uint32_t)(x) & MCAN_IR_TOO_MASK) >> MCAN_IR_TOO_SHIFT)

/*
 * MRAF (RW)
 *
 * Message RAM Access Failure
 * The flag is set, when the Rx Handler
 * .has not completed acceptance filtering or storage of an accepted message until the arbitration field of the following message has been received. In this case acceptance filtering or message
 * storage is aborted and the Rx Handler starts processing of the following message.
 * .was not able to write a message to the Message RAM. In this case message storage is aborted.
 * In both cases the FIFO put index is not updated resp. the New Data flag for a dedicated Rx Buffer is not set, a partly stored message is overwritten when the next message is stored to this location.
 * The flag is also set when the Tx Handler was not able to read a message from the Message RAM in time. In this case message transmission is aborted. In case of a Tx Handler access failure the
 * M_CAN is switched into Restricted Operation Mode (see Section 3.1.5). To leave Restricted Operation Mode, the Host CPU has to reset CCCR.ASM.
 * 0= No Message RAM access failure occurred
 * 1= Message RAM access failure occurred
 */
#define MCAN_IR_MRAF_MASK (0x20000UL)
#define MCAN_IR_MRAF_SHIFT (17U)
#define MCAN_IR_MRAF_SET(x) (((uint32_t)(x) << MCAN_IR_MRAF_SHIFT) & MCAN_IR_MRAF_MASK)
#define MCAN_IR_MRAF_GET(x) (((uint32_t)(x) & MCAN_IR_MRAF_MASK) >> MCAN_IR_MRAF_SHIFT)

