hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_mcan_regs.h
/*
 * TFEE (RW)
 *
 * Tx FIFO Empty Interrupt Enable
 */
#define MCAN_IE_TFEE_MASK (0x800U)
#define MCAN_IE_TFEE_SHIFT (11U)
#define MCAN_IE_TFEE_SET(x) (((uint32_t)(x) << MCAN_IE_TFEE_SHIFT) & MCAN_IE_TFEE_MASK)
#define MCAN_IE_TFEE_GET(x) (((uint32_t)(x) & MCAN_IE_TFEE_MASK) >> MCAN_IE_TFEE_SHIFT)

/*
 * TCFE (RW)
 *
 * Transmission Cancellation Finished Interrupt Enable
 */
#define MCAN_IE_TCFE_MASK (0x400U)
#define MCAN_IE_TCFE_SHIFT (10U)
#define MCAN_IE_TCFE_SET(x) (((uint32_t)(x) << MCAN_IE_TCFE_SHIFT) & MCAN_IE_TCFE_MASK)
#define MCAN_IE_TCFE_GET(x) (((uint32_t)(x) & MCAN_IE_TCFE_MASK) >> MCAN_IE_TCFE_SHIFT)

/*
 * TCE (RW)
 *
 * Transmission Completed Interrupt Enable
 */
#define MCAN_IE_TCE_MASK (0x200U)
#define MCAN_IE_TCE_SHIFT (9U)
#define MCAN_IE_TCE_SET(x) (((uint32_t)(x) << MCAN_IE_TCE_SHIFT) & MCAN_IE_TCE_MASK)
#define MCAN_IE_TCE_GET(x) (((uint32_t)(x) & MCAN_IE_TCE_MASK) >> MCAN_IE_TCE_SHIFT)

/*
 * HPME (RW)
 *
 * High Priority Message Interrupt Enable
 */
#define MCAN_IE_HPME_MASK (0x100U)
#define MCAN_IE_HPME_SHIFT (8U)
#define MCAN_IE_HPME_SET(x) (((uint32_t)(x) << MCAN_IE_HPME_SHIFT) & MCAN_IE_HPME_MASK)
#define MCAN_IE_HPME_GET(x) (((uint32_t)(x) & MCAN_IE_HPME_MASK) >> MCAN_IE_HPME_SHIFT)

/*
 * RF1LE (RW)
 *
 * Rx FIFO 1 Message Lost Interrupt Enable
 */
#define MCAN_IE_RF1LE_MASK (0x80U)
#define MCAN_IE_RF1LE_SHIFT (7U)
#define MCAN_IE_RF1LE_SET(x) (((uint32_t)(x) << MCAN_IE_RF1LE_SHIFT) & MCAN_IE_RF1LE_MASK)
#define MCAN_IE_RF1LE_GET(x) (((uint32_t)(x) & MCAN_IE_RF1LE_MASK) >> MCAN_IE_RF1LE_SHIFT)

/*
 * RF1FE (RW)
 *
 * Rx FIFO 1 Full Interrupt Enable
 */
#define MCAN_IE_RF1FE_MASK (0x40U)
#define MCAN_IE_RF1FE_SHIFT (6U)
#define MCAN_IE_RF1FE_SET(x) (((uint32_t)(x) << MCAN_IE_RF1FE_SHIFT) & MCAN_IE_RF1FE_MASK)
#define MCAN_IE_RF1FE_GET(x) (((uint32_t)(x) & MCAN_IE_RF1FE_MASK) >> MCAN_IE_RF1FE_SHIFT)

/*
 * RF1WE (RW)
 *
 * Rx FIFO 1 Watermark Reached Interrupt Enable
 */
#define MCAN_IE_RF1WE_MASK (0x20U)
#define MCAN_IE_RF1WE_SHIFT (5U)
#define MCAN_IE_RF1WE_SET(x) (((uint32_t)(x) << MCAN_IE_RF1WE_SHIFT) & MCAN_IE_RF1WE_MASK)
#define MCAN_IE_RF1WE_GET(x) (((uint32_t)(x) & MCAN_IE_RF1WE_MASK) >> MCAN_IE_RF1WE_SHIFT)

/*
 * RF1NE (RW)
 *
 * Rx FIFO 1 New Message Interrupt Enable
 */
#define MCAN_IE_RF1NE_MASK (0x10U)
#define MCAN_IE_RF1NE_SHIFT (4U)
#define MCAN_IE_RF1NE_SET(x) (((uint32_t)(x) << MCAN_IE_RF1NE_SHIFT) & MCAN_IE_RF1NE_MASK)
#define MCAN_IE_RF1NE_GET(x) (((uint32_t)(x) & MCAN_IE_RF1NE_MASK) >> MCAN_IE_RF1NE_SHIFT)

/*
 * RF0LE (RW)
 *
 * Rx FIFO 0 Message Lost Interrupt Enable
 */
#define MCAN_IE_RF0LE_MASK (0x8U)
#define MCAN_IE_RF0LE_SHIFT (3U)
#define MCAN_IE_RF0LE_SET(x) (((uint32_t)(x) << MCAN_IE_RF0LE_SHIFT) & MCAN_IE_RF0LE_MASK)
#define MCAN_IE_RF0LE_GET(x) (((uint32_t)(x) & MCAN_IE_RF0LE_MASK) >> MCAN_IE_RF0LE_SHIFT)

/*
 * RF0FE (RW)
 *
 * Rx FIFO 0 Full Interrupt Enable
 */
#define MCAN_IE_RF0FE_MASK (0x4U)
#define MCAN_IE_RF0FE_SHIFT (2U)
#define MCAN_IE_RF0FE_SET(x) (((uint32_t)(x) << MCAN_IE_RF0FE_SHIFT) & MCAN_IE_RF0FE_MASK)
#define MCAN_IE_RF0FE_GET(x) (((uint32_t)(x) & MCAN_IE_RF0FE_MASK) >> MCAN_IE_RF0FE_SHIFT)

/*
 * RF0WE (RW)
 *
 * Rx FIFO 0 Watermark Reached Interrupt Enable
 */
#define MCAN_IE_RF0WE_MASK (0x2U)
#define MCAN_IE_RF0WE_SHIFT (1U)
#define MCAN_IE_RF0WE_SET(x) (((uint32_t)(x) << MCAN_IE_RF0WE_SHIFT) & MCAN_IE_RF0WE_MASK)
#define MCAN_IE_RF0WE_GET(x) (((uint32_t)(x) & MCAN_IE_RF0WE_MASK) >> MCAN_IE_RF0WE_SHIFT)

/*
 * RF0NE (RW)
 *
 * Rx FIFO 0 New Message Interrupt Enable
 */
#define MCAN_IE_RF0NE_MASK (0x1U)
#define MCAN_IE_RF0NE_SHIFT (0U)
#define MCAN_IE_RF0NE_SET(x) (((uint32_t)(x) << MCAN_IE_RF0NE_SHIFT) & MCAN_IE_RF0NE_MASK)
#define MCAN_IE_RF0NE_GET(x) (((uint32_t)(x) & MCAN_IE_RF0NE_MASK) >> MCAN_IE_RF0NE_SHIFT)

/* Bitfield definition for register: ILS */
/*
 * ARAL (RW)
 *
 * Access to Reserved Address Line
 */
#define MCAN_ILS_ARAL_MASK (0x20000000UL)
#define MCAN_ILS_ARAL_SHIFT (29U)
#define MCAN_ILS_ARAL_SET(x) (((uint32_t)(x) << MCAN_ILS_ARAL_SHIFT) & MCAN_ILS_ARAL_MASK)
#define MCAN_ILS_ARAL_GET(x) (((uint32_t)(x) & MCAN_ILS_ARAL_MASK) >> MCAN_ILS_ARAL_SHIFT)

/*
 * PEDL (RW)
 *
 * Protocol Error in Data Phase Line
 */
#define MCAN_ILS_PEDL_MASK (0x10000000UL)
#define MCAN_ILS_PEDL_SHIFT (28U)
#define MCAN_ILS_PEDL_SET(x) (((uint32_t)(x) << MCAN_ILS_PEDL_SHIFT) & MCAN_ILS_PEDL_MASK)
#define MCAN_ILS_PEDL_GET(x) (((uint32_t)(x) & MCAN_ILS_PEDL_MASK) >> MCAN_ILS_PEDL_SHIFT)

/*
 * PEAL (RW)
 *
 * Protocol Error in Arbitration Phase Line
 */
#define MCAN_ILS_PEAL_MASK (0x8000000UL)
#define MCAN_ILS_PEAL_SHIFT (27U)
#define MCAN_ILS_PEAL_SET(x) (((uint32_t)(x) << MCAN_ILS_PEAL_SHIFT) & MCAN_ILS_PEAL_MASK)
#define MCAN_ILS_PEAL_GET(x) (((uint32_t)(x) & MCAN_ILS_PEAL_MASK) >> MCAN_ILS_PEAL_SHIFT)

/*
 * WDIL (RW)
 *
 * Watchdog Interrupt Line
 */
#define MCAN_ILS_WDIL_MASK (0x4000000UL)
#define MCAN_ILS_WDIL_SHIFT (26U)
#define MCAN_ILS_WDIL_SET(x) (((uint32_t)(x) << MCAN_ILS_WDIL_SHIFT) & MCAN_ILS_WDIL_MASK)
#define MCAN_ILS_WDIL_GET(x) (((uint32_t)(x) & MCAN_ILS_WDIL_MASK) >> MCAN_ILS_WDIL_SHIFT)

/*
 * BOL (RW)
 *
 * Bus_Off Status Interrupt Line
 */
#define MCAN_ILS_BOL_MASK (0x2000000UL)
#define MCAN_ILS_BOL_SHIFT (25U)
#define MCAN_ILS_BOL_SET(x) (((uint32_t)(x) << MCAN_ILS_BOL_SHIFT) & MCAN_ILS_BOL_MASK)
#define MCAN_ILS_BOL_GET(x) (((uint32_t)(x) & MCAN_ILS_BOL_MASK) >> MCAN_ILS_BOL_SHIFT)

/*
 * EWL (RW)
 *
 * Warning Status Interrupt Line
 */
#define MCAN_ILS_EWL_MASK (0x1000000UL)
#define MCAN_ILS_EWL_SHIFT (24U)
#define MCAN_ILS_EWL_SET(x) (((uint32_t)(x) << MCAN_ILS_EWL_SHIFT) & MCAN_ILS_EWL_MASK)
#define MCAN_ILS_EWL_GET(x) (((uint32_t)(x) & MCAN_ILS_EWL_MASK) >> MCAN_ILS_EWL_SHIFT)

/*
 * EPL (RW)
 *
 * Error Passive Interrupt Line
 */
#define MCAN_ILS_EPL_MASK (0x800000UL)
#define MCAN_ILS_EPL_SHIFT (23U)
#define MCAN_ILS_EPL_SET(x) (((uint32_t)(x) << MCAN_ILS_EPL_SHIFT) & MCAN_ILS_EPL_MASK)
#define MCAN_ILS_EPL_GET(x) (((uint32_t)(x) & MCAN_ILS_EPL_MASK) >> MCAN_ILS_EPL_SHIFT)

