hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_mcan_regs.h
/*
 * EN64 (RW)
 *
 * set to use 64bit timestamp.
 * when enabled, tsu can save up to 8 different timestamps, TS(k) and TS(k+1) are used for one 64bit timestamp, k is 0~7.
 * TSP can be used to select different one
 */
#define MCAN_TSCFG_EN64_MASK (0x8U)
#define MCAN_TSCFG_EN64_SHIFT (3U)
#define MCAN_TSCFG_EN64_SET(x) (((uint32_t)(x) << MCAN_TSCFG_EN64_SHIFT) & MCAN_TSCFG_EN64_MASK)
#define MCAN_TSCFG_EN64_GET(x) (((uint32_t)(x) & MCAN_TSCFG_EN64_MASK) >> MCAN_TSCFG_EN64_SHIFT)

/*
 * SCP (RW)
 *
 * Select Capturing Position
 * 0: Capture Timestamp at EOF
 * 1: Capture Timestamp at SOF
 */
#define MCAN_TSCFG_SCP_MASK (0x4U)
#define MCAN_TSCFG_SCP_SHIFT (2U)
#define MCAN_TSCFG_SCP_SET(x) (((uint32_t)(x) << MCAN_TSCFG_SCP_SHIFT) & MCAN_TSCFG_SCP_MASK)
#define MCAN_TSCFG_SCP_GET(x) (((uint32_t)(x) & MCAN_TSCFG_SCP_MASK) >> MCAN_TSCFG_SCP_SHIFT)

/*
 * TBCS (RW)
 *
 * Timebase Counter Select
 * When the internal timebase is excluded by synthesis, TBCS is
 * fixed to ‘1’.
 * 0: Timestamp value captured from internal timebase counter,
 *  ATB.TB[31:0] is the internal timbase counter
 * 1: Timestamp value captured from input tsu_tbin[31:0],ATB.TB[31:0] is tsu_tbin[31:0]
 */
#define MCAN_TSCFG_TBCS_MASK (0x2U)
#define MCAN_TSCFG_TBCS_SHIFT (1U)
#define MCAN_TSCFG_TBCS_SET(x) (((uint32_t)(x) << MCAN_TSCFG_TBCS_SHIFT) & MCAN_TSCFG_TBCS_MASK)
#define MCAN_TSCFG_TBCS_GET(x) (((uint32_t)(x) & MCAN_TSCFG_TBCS_MASK) >> MCAN_TSCFG_TBCS_SHIFT)

/*
 * TSUE (RW)
 *
 * Timestamp Unit Enable
 * 0: TSU disabled
 * 1: TSU enabled
 */
#define MCAN_TSCFG_TSUE_MASK (0x1U)
#define MCAN_TSCFG_TSUE_SHIFT (0U)
#define MCAN_TSCFG_TSUE_SET(x) (((uint32_t)(x) << MCAN_TSCFG_TSUE_SHIFT) & MCAN_TSCFG_TSUE_MASK)
#define MCAN_TSCFG_TSUE_GET(x) (((uint32_t)(x) & MCAN_TSCFG_TSUE_MASK) >> MCAN_TSCFG_TSUE_SHIFT)

/* Bitfield definition for register: TSS1 */
/*
 * TSL (R)
 *
 * Timestamp Lost
 * Each Timestamp register (TS0-TS15) is assigned one bit. The bits are set when the timestamp stored in the related Timestamp register was overwritten before it was read.
 * Reading a Timestamp register resets the related bit.
 */
#define MCAN_TSS1_TSL_MASK (0xFFFF0000UL)
#define MCAN_TSS1_TSL_SHIFT (16U)
#define MCAN_TSS1_TSL_GET(x) (((uint32_t)(x) & MCAN_TSS1_TSL_MASK) >> MCAN_TSS1_TSL_SHIFT)

/*
 * TSN (R)
 *
 * Timestamp New
 * Each Timestamp register (TS0-TS15) is assigned one bit. The bits are set when a timestamp was stored in the related
 * Timestamp register. Reading a Timestamp register resets the related bit.
 */
#define MCAN_TSS1_TSN_MASK (0xFFFFU)
#define MCAN_TSS1_TSN_SHIFT (0U)
#define MCAN_TSS1_TSN_GET(x) (((uint32_t)(x) & MCAN_TSS1_TSN_MASK) >> MCAN_TSS1_TSN_SHIFT)

/* Bitfield definition for register: TSS2 */
/*
 * TSP (R)
 *
 * Timestamp Pointer
 * The Timestamp Pointer is incremented by one each time a timestamp is captured. From its maximum value (3, 7, or 15
 * depending on number_ts_g), it is incremented to 0.
 * Value also signalled on output m_can_tsp[3:0].
 */
#define MCAN_TSS2_TSP_MASK (0xFU)
#define MCAN_TSS2_TSP_SHIFT (0U)
#define MCAN_TSS2_TSP_GET(x) (((uint32_t)(x) & MCAN_TSS2_TSP_MASK) >> MCAN_TSS2_TSP_SHIFT)

/* Bitfield definition for register: ATB */
/*
 * TB (RC)
 *
 * timebase for timestamp generation 31-0
 */
#define MCAN_ATB_TB_MASK (0xFFFFFFFFUL)
#define MCAN_ATB_TB_SHIFT (0U)
#define MCAN_ATB_TB_GET(x) (((uint32_t)(x) & MCAN_ATB_TB_MASK) >> MCAN_ATB_TB_SHIFT)

/* Bitfield definition for register: ATBH */
/*
 * TBH (RC)
 *
 * timebase for timestamp generation 63-32
 */
#define MCAN_ATBH_TBH_MASK (0xFFFFFFFFUL)
#define MCAN_ATBH_TBH_SHIFT (0U)
#define MCAN_ATBH_TBH_GET(x) (((uint32_t)(x) & MCAN_ATBH_TBH_MASK) >> MCAN_ATBH_TBH_SHIFT)

/* Bitfield definition for register: GLB_CTL */
/*
 * M_CAN_STBY (RW)
 *
 * m_can standby control
 */
#define MCAN_GLB_CTL_M_CAN_STBY_MASK (0x80000000UL)
#define MCAN_GLB_CTL_M_CAN_STBY_SHIFT (31U)
#define MCAN_GLB_CTL_M_CAN_STBY_SET(x) (((uint32_t)(x) << MCAN_GLB_CTL_M_CAN_STBY_SHIFT) & MCAN_GLB_CTL_M_CAN_STBY_MASK)
#define MCAN_GLB_CTL_M_CAN_STBY_GET(x) (((uint32_t)(x) & MCAN_GLB_CTL_M_CAN_STBY_MASK) >> MCAN_GLB_CTL_M_CAN_STBY_SHIFT)

/*
 * STBY_CLR_EN (RW)
 *
 * m_can standby clear control
 * 0:controlled by software by standby bit[bit31]
 * 1:auto clear standby by hardware when rx data is  0
 */
#define MCAN_GLB_CTL_STBY_CLR_EN_MASK (0x40000000UL)
#define MCAN_GLB_CTL_STBY_CLR_EN_SHIFT (30U)
#define MCAN_GLB_CTL_STBY_CLR_EN_SET(x) (((uint32_t)(x) << MCAN_GLB_CTL_STBY_CLR_EN_SHIFT) & MCAN_GLB_CTL_STBY_CLR_EN_MASK)
#define MCAN_GLB_CTL_STBY_CLR_EN_GET(x) (((uint32_t)(x) & MCAN_GLB_CTL_STBY_CLR_EN_MASK) >> MCAN_GLB_CTL_STBY_CLR_EN_SHIFT)

/*
 * STBY_POL (RW)
 *
 * standby polarity selection
 */
#define MCAN_GLB_CTL_STBY_POL_MASK (0x20000000UL)
#define MCAN_GLB_CTL_STBY_POL_SHIFT (29U)
#define MCAN_GLB_CTL_STBY_POL_SET(x) (((uint32_t)(x) << MCAN_GLB_CTL_STBY_POL_SHIFT) & MCAN_GLB_CTL_STBY_POL_MASK)
#define MCAN_GLB_CTL_STBY_POL_GET(x) (((uint32_t)(x) & MCAN_GLB_CTL_STBY_POL_MASK) >> MCAN_GLB_CTL_STBY_POL_SHIFT)

/*
 * TSU_TBIN_SEL (RW)
 *
 * external timestamp select. each CAN block has 4 timestamp input, this register is used to select one of them as timestame if TSCFG.TBCS is set to 1
 */
#define MCAN_GLB_CTL_TSU_TBIN_SEL_MASK (0x3U)
#define MCAN_GLB_CTL_TSU_TBIN_SEL_SHIFT (0U)
#define MCAN_GLB_CTL_TSU_TBIN_SEL_SET(x) (((uint32_t)(x) << MCAN_GLB_CTL_TSU_TBIN_SEL_SHIFT) & MCAN_GLB_CTL_TSU_TBIN_SEL_MASK)
#define MCAN_GLB_CTL_TSU_TBIN_SEL_GET(x) (((uint32_t)(x) & MCAN_GLB_CTL_TSU_TBIN_SEL_MASK) >> MCAN_GLB_CTL_TSU_TBIN_SEL_SHIFT)

/* Bitfield definition for register: GLB_STATUS */
/*
 * M_CAN_INT1 (R)
 *
 * m_can interrupt status1
 */
#define MCAN_GLB_STATUS_M_CAN_INT1_MASK (0x8U)
#define MCAN_GLB_STATUS_M_CAN_INT1_SHIFT (3U)
#define MCAN_GLB_STATUS_M_CAN_INT1_GET(x) (((uint32_t)(x) & MCAN_GLB_STATUS_M_CAN_INT1_MASK) >> MCAN_GLB_STATUS_M_CAN_INT1_SHIFT)

