hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_mcan_regs.h
#define MCAN_MESSAGE_BUFF_584 (584UL)
#define MCAN_MESSAGE_BUFF_585 (585UL)
#define MCAN_MESSAGE_BUFF_586 (586UL)
#define MCAN_MESSAGE_BUFF_587 (587UL)
#define MCAN_MESSAGE_BUFF_588 (588UL)
#define MCAN_MESSAGE_BUFF_589 (589UL)
#define MCAN_MESSAGE_BUFF_590 (590UL)
#define MCAN_MESSAGE_BUFF_591 (591UL)
#define MCAN_MESSAGE_BUFF_592 (592UL)
#define MCAN_MESSAGE_BUFF_593 (593UL)
#define MCAN_MESSAGE_BUFF_594 (594UL)
#define MCAN_MESSAGE_BUFF_595 (595UL)
#define MCAN_MESSAGE_BUFF_596 (596UL)
#define MCAN_MESSAGE_BUFF_597 (597UL)
#define MCAN_MESSAGE_BUFF_598 (598UL)
#define MCAN_MESSAGE_BUFF_599 (599UL)
#define MCAN_MESSAGE_BUFF_600 (600UL)
#define MCAN_MESSAGE_BUFF_601 (601UL)
#define MCAN_MESSAGE_BUFF_602 (602UL)
#define MCAN_MESSAGE_BUFF_603 (603UL)
#define MCAN_MESSAGE_BUFF_604 (604UL)
#define MCAN_MESSAGE_BUFF_605 (605UL)
#define MCAN_MESSAGE_BUFF_606 (606UL)
#define MCAN_MESSAGE_BUFF_607 (607UL)
#define MCAN_MESSAGE_BUFF_608 (608UL)
#define MCAN_MESSAGE_BUFF_609 (609UL)
#define MCAN_MESSAGE_BUFF_610 (610UL)
#define MCAN_MESSAGE_BUFF_611 (611UL)
#define MCAN_MESSAGE_BUFF_612 (612UL)
#define MCAN_MESSAGE_BUFF_613 (613UL)
#define MCAN_MESSAGE_BUFF_614 (614UL)
#define MCAN_MESSAGE_BUFF_615 (615UL)
#define MCAN_MESSAGE_BUFF_616 (616UL)
#define MCAN_MESSAGE_BUFF_617 (617UL)
#define MCAN_MESSAGE_BUFF_618 (618UL)
#define MCAN_MESSAGE_BUFF_619 (619UL)
#define MCAN_MESSAGE_BUFF_620 (620UL)
#define MCAN_MESSAGE_BUFF_621 (621UL)
#define MCAN_MESSAGE_BUFF_622 (622UL)
#define MCAN_MESSAGE_BUFF_623 (623UL)
#define MCAN_MESSAGE_BUFF_624 (624UL)
#define MCAN_MESSAGE_BUFF_625 (625UL)
#define MCAN_MESSAGE_BUFF_626 (626UL)
#define MCAN_MESSAGE_BUFF_627 (627UL)
#define MCAN_MESSAGE_BUFF_628 (628UL)
#define MCAN_MESSAGE_BUFF_629 (629UL)
#define MCAN_MESSAGE_BUFF_630 (630UL)
#define MCAN_MESSAGE_BUFF_631 (631UL)
#define MCAN_MESSAGE_BUFF_632 (632UL)
#define MCAN_MESSAGE_BUFF_633 (633UL)
#define MCAN_MESSAGE_BUFF_634 (634UL)
#define MCAN_MESSAGE_BUFF_635 (635UL)
#define MCAN_MESSAGE_BUFF_636 (636UL)
#define MCAN_MESSAGE_BUFF_637 (637UL)
#define MCAN_MESSAGE_BUFF_638 (638UL)
#define MCAN_MESSAGE_BUFF_639 (639UL)


#endif /* HPM_MCAN_H */
